Revit 2027 API
UnitTypeId.NewtonMeters Property
 Newton meters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId NewtonMeters { get; }
Public Shared ReadOnly Property NewtonMeters As ForgeTypeId
	Get
public:
static property ForgeTypeId^ NewtonMeters {
	ForgeTypeId^ get ();
}
static member NewtonMeters : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace